secrets-api/app/controllers/secrets_controller.rb

INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "My first secret!"], ["user_id", "3"], ["created_at", "2015-06-26 19:17:02.369104"], ["updated_at", "2015-06-26 19:17:02.369104"]]
---
  def create
    @secret = Secret.new params.require(:secret).permit(:content, :user_id)

    if @secret.save