secrets-api/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "bryan"]]
---
  def create
    email = params[:email]
    password = params[:password]

    @user = User.find_by email: email