secrets-api/app/controllers/users_controller.rb

  def create
    @user = User.new params.require(:user).permit(:email, :name, :password, :password_confirmation)
    @user.key = SecureRandom.hex(8) # generate key and save it with user's info

    if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"